Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: For example, in the following code example PlayerView passes its state property isPlaying to PlayButton using $isPlaying:
ja: 例えば、以下のコード例においてPlayerViewはそれの状態プロパティisPlayingをPlayButtonへと$isPlayingを使って渡します：

source: For example, in the following code example the button’s actions toggles the value of showingProfile, which toggles wrappedValue:
ja: 例えば、以下のコード例においてボタンのもつアクションはshowingProfileの値を切り替えます、それはwrappedValueを切り替えます：

source: For example, in the following code example, PlayerView passes both the old and new values to the model.
ja: 例えば、次のコード例において、PlayerViewは古いそして新しい値の両方をmodelに渡します。

source: For example, on iOS a button is triggered by tapping it onscreen, whereas on tvOS it’s triggered by pressing “select” on an external remote while the button is focused.
ja: 例えば、iOS上ではボタンはそれを画面上でタップすることで作動されます、一方でtvOS上ではそれはボタンがフォーカスされている間に “select” を外部リモコン上で押すことによって作動されます。

source: For example, on iOS, forms appear as grouped lists.
ja: 例えば、iOSでは、フォームはグループにされたリストとして現れます。

source: For example, reversing the characters in a string is a reversible operation, whereas changing the characters in a string to be uppercase is a nonreversible operation.
ja: たとえば、ある文字列中の文字を逆にすることは元に戻せる操作です、その一方である文字列の中の文字をアップケースであるように変えることは元に戻せない操作です。

source: For example, the Hoefler Text font uses a ligature for the letter combination ffl, as in the word raffle, shown here with a small negative and a small positive kerning:
ja: 例えば、Hoefler Textフォントはあるリガチャを文字組み合わせfflに対して使います、ここで小さな負のおよび小さな正のカーニングで示される、単語raffleでのように：

source: For example, the border that results from the above code outlines the full width of the frame.
ja: 例えば、上のコードの結果である境界線は、そのフレームの幅いっぱいに輪郭を描きます。

source: For example, the first ellipse in the following code is rendered in a fixed 200 by 100 frame.
ja: 例えば、最初の楕円は以下のコードにおいて、ある固定された200と100のフレームの中に描出されます。

source: For example, the following contextMenu function accepts a closure that produces one or more views via the view builder.
ja: 例えば、以下のcontextMenu関数は、１つ以上のビューをビュービルダーを通して生み出すクロージャを受け入れます。

source: For example, the following style adds a red border around the button, but otherwise preserves the button’s current style:
ja: 例えば、以下のスタイルは赤い境界線をボタンの周りに加えます、しかしそれ以外はボタンのもつ現在のスタイルを保全します。

source: For example, the gray border drawn by this view surrounds the original position of the text:
ja: 例えば、このビューによって描画される灰色の境界線は、テキストの元の位置を囲みます：

source: For example, the layout for the caption in this view fits within the width of the image:
ja: 例えば、このビューでの字幕に対するレイアウトは、画像の幅内にぴったり合います：

source: For example, this code applies clipping shape to a square image:
ja: 例えば、このコードは切り抜き形状を正方形画像に適用します：

source: For example, to count the number of times your app recognizes a long press, add an onChanged(_:) callback and increment a counter.
ja: 例えば、あなたのアプリが長押しを認識する回数を数えるには、onChanged(_:)コールバックを加えて、カウンターを漸増してください。

source: For example, to create a list cell that triggers an action when selected by the user, add a button to the list’s content.
ja: 例えば、ユーザによって選択された時にある動作を引き起こすリストセル（リストのます目）を作成するには、ボタンをそのリストのもつ内容に加えてください。

source: For example, to get the reversed version of a string, reverse its characters and initialize a new String instance from the result.
ja: 例えば、ある文字列の逆版を得るには、それの文字を逆にして、新しいStringインスタンスをその結果から初期化してください。

source: For example, to make a view that changes color while the user performs a long press, add a gesture state property and update it in the updating callback.
ja: 例えば、ユーザが長押しを実行する間に色を変えるビューを作るには、ジェスチャ状態プロパティを加えてそしてそれをupdatingコールバックにおいて更新してください。

source: For example, to require a long press before the user can drag a view, you sequence a DragGesture after a LongPressGesture.
ja: 例えば、ユーザがビューをドラッグできる前に長押しを要求するには、あなたはDragGestureをLongPressGestureの後に配列します。

source: For example, to stop counting long press attempts after the user completes a long press, add an onEnded(_:) callback and conditionally apply the gesture modifier.
ja: 例えば、長押し試みの計数をユーザがある長押しを完了する後に止めるには、onEnded(_:)コールバックを加えてそして条件付きでジェスチャ修飾子を適用してください。

source: For example, use it to provide data or relevant state information.
ja: 例えば、それを使ってデータまたは関連がある状態情報を提供してください。

source: For example, use the provided environment values to configure the appearance of your view controller and views.
ja: 例えば、提供された環境値を使って、あなたのビューコントローラとビューの外観を構成設定してください。

source: For example, use the provided environment values to configure the appearance of your view.
ja: 例えば、提供された環境値を使って、あなたのビューの外観を構成設定してください。

source: For example, using a PartialRangeFrom range expression with an array accesses the subrange from the start of the range expression until the end of the array.
ja: 例えば、PartialRangeFrom範囲式をある配列で使うことは、その下位範囲に範囲式の始まりから配列の終わりまでにアクセスします。

source: For example, you can clear a cache when you notice that a scene moves to the background:
ja: 例えば、あなたはあるキャッシュを、あなたがあるシーンがバックグラウンドに移動することに気づく時にクリアできます：

source: For example, you can create a binding between a Toggle and a Bool property of a State.
ja: 例えば、あなたはバインディングをあるToggleとあるStateのBoolプロパティの間に作成できます。

source: For example, you can display the names of the colors red, green, and blue in their respective colors:
ja: 例えば、あなたは色、赤、緑、そして青の名前を各自の色で表示できます：

source: For example, you can import a file using an ImportFilesAction instance, or open a URL with an OpenURLAction instance.
ja: たとえば、あなたはファイルをImportFilesActionインスタンスを使ってインポートできます、またはURLをOpenURLActionインスタンスで開けます。

source: For example, you can include it as one of your app's root interface controllers, or present it modally.
ja: 例えば、あなたはそれをあなたのアプリのもつルートインターフェイスコントローラの１つとして含めること、またはそれをモーダルに提示できます。

source: For example, you can place UIKit views and view controllers inside SwiftUI views, and vice versa.
ja: 例えば、あなたはUIKitビューおよびビューコントローラをSwiftUIビュー内部に設置できます、そして逆もまた同様。

source: For example, you can propose that a text view ignore the safe area’s top inset:
ja: 例えば、あなたは、テキストビューが安全領域のもつ上部インセット（余白）を無視することを提案できます：

source: For example, you can shuffle the numbers between 0 and 9 by calling the shuffled() method on that range:
ja: 例えば、あなたは0と9の間の数をシャッフルすることが、shuffled()メソッドをこの範囲上で呼び出すことによって可能です：

source: For example, you can shuffle the numbers between 0 and 9 by calling the shuffled(using:) method on that range:
ja: 例えば、あなたは0と9の間の数をシャッフルすることが、shuffled(using:)メソッドをその範囲上で呼び出すことによって可能です：

source: For example, you can use a hosting view to implement a custom control.
ja: 例えば、あなたはホスティングビューを使ってあつらえのコントロールを実装できます。

source: For example, you can use the frame(width:height:alignment:) modifier to propose specific dimensions to the view.
ja: 例えば、あなたはframe(width:height:alignment:)修飾子を使って、特定の次元それらをビューに提案できます。

source: For example, you can use this method on an array of integers to filter adjacent equal entries or count frequencies.
ja: 例えば、あなたはこのメソッドを整数からなる配列で使うことで、隣接する同等の項目をフィルタしたり頻度を数えたりできます。

source: For example, you can use this method on an array of numbers to find their sum or product.
ja: 例えば、あなたはこのメソッドを数値からなる配列で使うことで、それらの合計を見つけるまたは生成できます。

source: For example, you can wrap a text view in an invisible box with a given width using the frame(width:height:alignment:) modifier to influence its layout, and then use the border(_:width:) modifier to draw an outline around that:
ja: 例えば、あなたは可視ボックスの中のテキストビューをframe(width:height:alignment:)修飾子を使ってラップすることでそれのレイアウトに影響を与えて、それからborder(_:width:)修飾子を使ってそれの周囲に輪郭を描画できます：

source: For example, you could truncate the English alphabet as "...wxyz".
ja: 例えば、あなたは英語アルファベットを "...wxyz" のように切り詰められます。

source: For example, you could truncate the English alphabet as "ab...yz".
ja: 例えば、あなたは英語アルファベットを "ab...yz" のように切り詰められます。

source: For example, you could truncate the English alphabet as "abcd...".
ja: 例えば、あなたは英語アルファベットを "abcd..." のように切り詰められます。

source: For example, you could use this method to label a button that plays music with the text “Play”.
ja: 例えば、あなたはこのメソッドを使って、音楽を再生するボタンにテキスト “Play” でラベルをつけられます。

source: For example, you might call it at launch time to change the set of pages you want displayed, or call it at runtime to change the active set of pages.
ja: 例えば、あなたはそれを起動時に呼び出して、あなたが表示したいページの一揃いを変更する、またはそれを実行時に呼び出して、活動的なページの一揃いを変更するかもしれません。

source: For example, you might define a property in your coordinator that binds to a SwiftUI value, as shown in the following code example.
ja: 例えば、あなたはプロパティをあなたのコーディネータの中で定義するかもしれません、それはSwiftUI値へとバインドするものです、以下のコード例で示されるように。

source: For example, you might provide an instance that binds its variables to SwiftUI properties, causing the two to remain synchronized.
ja: 例えば、あなたはあるインスタンスを提供するかもしれません、それはそれの変数をSwiftUIプロパティへとバインドして、その２つが同期されたままであるようにするものです。

source: For example, you might use the teardown process to notify other objects that the view controller is disappearing.
ja: 例えば、あなたは解体処理を使って、ビューコントローラが見えなくしている他のオブジェクトに通知します。

source: For example, you might use the teardown process to notify other objects that the view is disappearing.
ja: 例えば、あなたは解体処理を使って、ビューが見えなくしている他のオブジェクトに通知します。

source: For example, you might use the teardown process to notify other parts of your app that the interface object is disappearing.
ja: 例えば、あなたは解体処理を使って、インターフェイスオブジェクトが見えなくしているあなたのアプリの他の部分に通知します。

source: For example, you might use this method to remove observers or update other parts of your SwiftUI interface.
ja: 例えば、あなたはこのメソッドを使って、オブザーバを取り除いたり、あなたのSwiftUIインターフェイスの他の部分を更新したりするかもしれません。

source: For example, you use a coordinator to forward target-action and delegate messages from your interface object to any SwiftUI views.
ja: 例えば、あなたはあるコーディネータを使って、ターゲットアクションと委任先メッセージをあなたのインターフェイスオブジェクトからあらゆるSwiftUIビューへと転送します。

source: For example, you use a coordinator to forward target-action and delegate messages from your view controller to any SwiftUI views.
ja: 例えば、あなたはあるコーディネータを使って、ターゲットアクションと委任先メッセージをあなたのビューコントローラからあらゆるSwiftUIビューへと転送します。

source: For example, you use a coordinator to forward target-action and delegate messages from your view to any SwiftUI views.
ja: 例えば、あなたはあるコーディネータを使って、ターゲットアクションと委任先メッセージをあなたのビューからあらゆるSwiftUIビューへと転送します。

source: For example:
ja: 例えば：

source: For information about how to build and configure views, see the View protocol.
ja: どのようにビューをビルドおよび構成設定するかについての情報として、Viewプロトコルを見てください。

source: For instance, in the following code example the binding variable isPlaying returns the value of wrappedValue:
ja: 例えば、以下のコード例においてバインディング変数isPlayingはwrappedValueの値を返します：

source: For other collections the counters may be out of range or of the wrong type to use as an index.
ja: 他のコレクションに対してこれらのカウンタは、インデックスとして使うのには範囲外または間違った型になるでしょう。

source: For the ShippingOptions declaration, see the OptionSet protocol discussion.
ja: ShippingOptions宣言については、OptionSetプロトコル解説を見てください。

source: For the Mac idiom, the default toggle style is a checkbox.
ja: Mac流儀では、省略時のトグルスタイルはチェックボックスです。

source: For the TV idom, the default toggle style is a button.
ja: TV流儀では、省略時のトグルスタイルはボタンです。

source: For the common case of text-only labels, you can use the convenience initializer that takes a title string (or localized string key) as its first parameter, instead of a trailing closure:
ja: テキストのみのラベルの一般的な場合に対して、あなたは便宜イニシャライザを使用できます、それはタイトル文字列（またはローカライズ文字列キー）を最初の引数としてとります、後付クロージャではなく。

source: For the phone, pad, and watch idioms, the default toggle style is a switch.
ja: phone、pad、そしてwatch流儀では、省略時のトグルスタイルはスイッチです。

source: For this reason, declare your state properties as private, to prevent clients of your view from accessing it.
ja: この理由のために、あなたの状態プロパティをプライベートとして宣言してください、あなたのビューのクライアントがそれにアクセスするのを防ぐために。

source: Framework
ja: フレームワーク

source: Framework Integration
ja: フレームワーク統合

source: From Protocol
ja: 由来プロトコル

source: Fruta: Building a Feature-Rich App with SwiftUI
ja: 成果：機能豊かなアプリをSwiftUIで組み立てる

source: Generate dynamic, interactive previews of your custom views.
ja: あなたのあつらえのビューの動的な、相互作用するプレビューを生成します。

source: Generates a collection of previews.
ja: プレビューそれらからなるあるコレクションを生成します。

source: Generates a frame for the view.
ja: ビューのためのフレームを生成します。

source: Generates a uniquely identified view that can be inserted or removed.
ja: 特有に識別されるビューを生成します、それは挿入または除去されることができます。

source: Generating Previews
ja: プレビューを作成する

source: Generic Instance Method
ja: 総称体インスタンスメソッド

source: Geometry
ja: 幾何学

source: Gesture Options
ja: ジェスチャオプション

source: Gesture Support
ja: ジェスチャサポート

source: Gesture modifiers handle all of the logic needed to process user-input events such as touches, and recognize when those events match a known gesture pattern, such as a long press or rotation.
ja: ジェスチャ修飾子は、さまざまなユーザ入力イベント、たとえばタッチなどに必要とされる論理の全てを取り扱います、そしてそれらのイベントが既知のジェスチャパターン、たとえば長押しや回転などに合致する場合に認識します。

source: Gesture modifiers offer three ways to receive updates: updating(_:body:), onChanged(_:), and onEnded(_:).
ja: ジェスチャ修飾子は、更新を受け取るために３つの方法を提示します：updating(_:body:)、onChanged(_:)、そしてonEnded(_:)。

source: Gestures
ja: ジェスチャ

source: Gets a custom font with the given name and size.
ja: 与えられた名前とサイズをもつカスタムフォントを取得します。

source: Gets a font from a platform font instance.
ja: プラットホームフォントインスタンスからフォントを取得する

source: Gets a system font with the given style and design.
ja: 指定されたスタイストデザインをもつシステムフォントを取得します。

source: Gets the current body of the caller.
ja: 呼び出し側の現在のボディを取得します。

source: Gets the explicit value of the given alignment guide in this view, or nil if no such value exists.
ja: このビューの中の与えられた整列ガイドの明示的な値を取得します、またはそのような値が存在しないならばnil。

source: Gets the value of the given horizontal guide.
ja: 与えられた水平ガイドの値を取得します。

source: Gets the value of the given vertical guide.
ja: 与えられた垂直ガイドの値を取得します。

source: Getting Alert Buttons
ja: 警報ボタンを取得する

source: Getting All Font Styles
ja: 全てのフォントスタイルを取得する

source: Getting All Size Categories
ja: 全てのサイズカテゴリを取得する

source: Getting DTD Nodes by Name
ja: DTDノードを名前によって取得する

source: Getting Hash Information
ja: ハッシュ情報を取得する

source: Getting Hashing Information
ja: ハッシュ化情報を取得する

source: Getting Information About a Transaction
ja: トランザクションについての情報を取得する

source: Getting Information About a Transformer
ja: 変換器についての情報を取得する

source: Getting Rendering Modes
ja: 描出モードを取得する

source: Getting Standard Fonts
ja: 標準フォントを取得する

source: Getting System Fonts
ja: システムフォントを取得する

source: Getting a Binding Value
ja: バインディング値を取得する

source: Getting a Button
ja: ボタンを取得する

source: Getting a Scanner’s String
ja: スキャナーのもつ文字列を取得する

source: Getting the Body
ja: ボディを取得する

source: Getting the Current Environment Data
ja: 現在の環境データを取得する

source: Getting the Default Value
ja: 省略時の値を取得する

source: Getting the Dimensions
ja: 寸法を取得する

source: Getting the Drop Location
ja: ドロップ場所を取得する

source: Getting the Environment Data
ja: 環境データを取得する

source: Getting the Fetched Results
ja: 取って来た結果を取得する

source: Getting the File Handles for a Pipe
ja: パイプに対するファイルハンドルを取得する

source: Getting the Identity Modifier
ja: 同一性修飾子を取得する

source: Getting the Operation
ja: 操作を取得する

source: Getting the Root View
ja: ルートビューを取得する

source: Getting the Sensitivity
ja: 感度を取得する

source: Getting the Value
ja: 値を取得する

source: Getting the View
ja: ビューを取得する

source: Give users the option to customize their widgets, by adding a custom SiriKit intent definition to your project.
ja: ユーザに彼らのウィジェットをカスタマイズする選択肢を与えてください、あるあつらえのSiriKitインテント定義をあなたのプロジェクトに加えることによって。

source: Global Variable
ja: グローバル変数

source: Guides
ja: ガイド

source: Halfwidth and Fullwidth Form Conversion
ja: 半角および全角形式の変換

source: Handling Attributes
ja: 属性を取り扱う

source: Handling Drag and Drop
ja: ドラッグドロップを取り扱う

source: Handling Layout Direction
ja: レイアウト方向を取り扱う

source: Handling Multiline Text
ja: 複数行テキストを取り扱う

source: Handling Namespaces
ja: 名前空間を取り扱う

source: Handling Publisher Events
ja: パブリッシャーイベントを取り扱う

source: Handling User Input
ja: ユーザ入力を取り扱う

source: Handling View Events
ja: ビューイベントを取り扱う

source: Handling View Hover and Focus
ja: ビューのホバーとフォーカスを取り扱う

source: Handling View Taps and Gestures
ja: ビューのタップとジェスチャーを取り扱う

source: Hash values are not guaranteed to be equal across different executions of your program.
ja: ハッシュ値は、あなたのプログラムの異なる遂行にわたって等しいと保証されません。

source: Hashes the essential components of the truncation mode by feeding them into the given hash function.
ja: 切り詰めモードの基本構成要素を、それらをこの与えられたハッシュ関数へと与えることによってハッシュ化します。

source: Hashes the essential components of this value by feeding them into the given hasher.
ja: この値の必須の構成要素を、それらをこの与えられたハーシャーに供給する事によってハッシュ化します。

source: Hashes the value of a simultaneous gesture by feeding it into the given hasher.
ja: ある同時ジェスチャの値を、それをこの与えられたハーシャーに供給する事によってハッシュ化します。

source: Hashing
ja: ハッシュ化

source: Here the offset values inside a stack and its contained views is the difference of their absolute offsets.
ja: ここでスタックそしてそれの含んでいるビューの内側のオフセット値それらは、それらの絶対オフセットの違いがあります。

source: Here, a set of strings is created from an array literal holding only strings:
ja: ここでは、文字列の集合が文字列のみを保持する配列リテラルから作成されます：

source: Here, the VStack in the ContentView named “stack” is composed of a red frame with a custom Circle view overlay(_:alignment:) at its center.
ja: ここで、“stack” と名前をつけられたContentViewの中のVStackは、赤いフレームから組み立てられ、あるあつらえのCircleビューのoverlay(_:alignment:)をそれの中心でともないます。

source: Here’s an example of sorting a list of students’ names.
ja: ここに、生徒名のリストをソートする例があります。

source: Here’s an example that finds a student name that begins with the letter “A”:
ja: ここに、文字「A」で始まる生徒名を見つける例があります：

source: Hidden views are invisible and can’t receive or respond to interactions.
ja: 隠されたビューは不可視です、そして相互作用を受け取ったり応答したり出来ません。

source: Hides the labels of any controls contained within this view.
ja: このビュー内に含まれるあらゆるコントロールのラベルを隠します。

source: Hides the navigation bar back button for the view.
ja: ビューに対してナビゲーションバー戻るボタンを隠します。

source: Hides the navigation bar for the view.
ja: ビューに対してナビゲーションバーを隠します。

source: Hides the navigation bar for this view.
ja: このビューに対するナビゲーションバーを隠します。

source: Hides the view.
ja: ビューを隠します。

source: Hiding and Disabling Views
ja: ビューを隠すおよび無効にする

source: Hierarchical Views
ja: 階層ビュー

source: High sensitivity.
ja: 高感度。

source: Higher numbers are sorted first.
ja: より高い数が最初に分類されます。

source: Hit Testing in the View
ja: ビューにおいてヒットテストする

source: Hosting controllers to add AppKit, UIKit, or WatchKit views and view controllers to your SwiftUI interfaces.
ja: AppKit、UIKit、またはWatchKitのビューおよびビューコントローラがあなたのSwiftUIインターフェイスへと加えるホスティングコントローラ。

source: How a picker using the default picker style appears largely depends on the platform and the view type in which it appears.
ja: どのようにピッカーがその省略時のピッカースタイルを使って現れるか、主としてプラットホームおよびそれにおいてそれが現れるビュー型に依存して。

source: How much the Digital Crown needs to be rotated to move between two integer numbers.
ja: ２つの整数の間を移動するために、どれくらい多く「デジタルクラウン」が回される必要があるか。

source: However, a view displaying the value is updated asynchronously and may not show the new value immediately.
ja: しかしながら、値を表示しているビューは非同期に更新されます、そして新しい値をすぐに示さないかもしれません。

source: However, updates to a view displaying the value happens asynchronously, so the view may not show the change immediately.
ja: しかしながら、値を表示しているビューに対する更新は非同期に起こります、それでそのビューはその変更をすぐに示さないかもしれません。

source: However, you can request localization by creating a LocalizedStringKey instance first, which triggers the init(_:tableName:bundle:comment:) initializer instead:
ja: しかしながら、あなたはローカライゼーションを要求できます、LocalizedStringKeyインスタンスを最初に作成することによって、それはinit(_:tableName:bundle:comment:)イニシャライザを代わりに引き起こします：

source: However, you don’t access wrappedValue directly.
ja: しかしながら、あなたはwrappedValueに直接にアクセスしません。

source: Identifier types for standard locations that new command groups can be placed relative to.
ja: 新しいコマンドグループがそれに相対的に設置される標準位置に対する識別子型。

source: Identifying Buttons
ja: ボタンを識別する

source: Identifying Related Types
ja: 関連型を識別する

source: Identifying Views
ja: ビューを識別する

source: Identifying the Operation Resolution
ja: 操作解決を明確にする

source: If action is nil, the call has no effect.
ja: actionがnilならば、呼び出しは効果を持ちません。

source: If animation is nil, the view doesn’t animate.
ja: animationがnilならば、ビューはアニメーションしません。

source: If areEquivalent(a, b) and areEquivalent(b, c) are both true, then areEquivalent(a, c) is also true.
ja: areEquivalent(a, b)とareEquivalent(b, c)が両方ともtrueならば、そのときareEquivalent(a, c)もまたtrueである。

source: If areInIncreasingOrder(a, b) and areInIncreasingOrder(b, c) are both true, then areInIncreasingOrder(a, c) is also true.
ja: areInIncreasingOrder(a, b)とareInIncreasingOrder(b, c)が両方ともtrueならば、そのときareInIncreasingOrder(a, c)もまたtrueである。

source: If aspectRatio is nil, the resulting view maintains this view’s aspect ratio.
ja: aspectRatioがnilならば、結果ビューはこのビューのもつアスペクト比を維持します。

source: If color is nil, the strikethrough uses the default foreground color.
ja: colorがnilならば、取り消し線は省略時の前景色を使います。

source: If color is nil, the underline uses the default foreground color.
ja: colorがnilならば、下線は省略時の前景色を使います。

source: If distance > 0, limit should be greater than i to have any effect.
ja: もしdistance > 0ならば、limitは、何らかの効果を持つためにiより大きくあるべきです。

source: If distance > 0, a limit that is less than i has no effect.
ja: distance > 0ならば、iより少ない限度は効果を持ちません。

source: If end is equal to start, the result is zero.
ja: endがstartに等しいならば、結果はゼロです。

source: If endAngle - startAngle > 2π, the gradient only draws the last complete turn.
ja: endAngle - startAngle > 2π ならば、勾配は最後の完了回転を描画するだけです。

source: If eoFill is true, this method uses the even-odd rule to define which points are inside the path.
ja: eoFillがtrueならば、このメソッドは偶奇規則を使ってどの点がパスの内側であるか定義します。

source: If false, an empty subsequence is returned in the result for each consecutive pair of separator elements in the collection and for each instance of separator at the start or end of the collection.
ja: falseならば、このコレクション中の連続するseparator要素の対それぞれに、そしてコレクションの始めと終わりのseparatorインスタンスそれぞれに、１つの空の下位シーケンスが結果において返されます。

source: If false, an empty subsequence is returned in the result for each consecutive pair of separator elements in the sequence and for each instance of separator at the start or end of the sequence.
ja: falseならば、このシーケンス中の連続するseparator要素の対それぞれに、そしてシーケンスの始めと終わりのseparatorインスタンスそれぞれに、１つの空の下位シーケンスが結果において返されます。

source: If false, an empty subsequence is returned in the result for each pair of consecutive elements satisfying the isSeparator predicate and for each element at the start or end of the collection satisfying the isSeparator predicate.
ja: falseならば、isSeparator述部を満たす連続する要素のペアそれぞれに対しておよびisSeparator述部を満たすコレクションの始まりまたは終わりでの要素それぞれに対して結果において１つの空の下位シーケンスが返されます。

source: If maxSplits + 1 subsequences are returned, the last one is a suffix of the original collection containing the remaining elements.
ja: maxSplits + 1の下位シーケンスが返されるならば、最後のものは、残りの要素を含んでいる元コレクションの後ろ部分です。

source: If maxSplits + 1 subsequences are returned, the last one is a suffix of the original sequence containing the remaining elements.
ja: maxSplits + 1の下位シーケンスが返されるならば、最後のものは、残りの要素を含んでいる元シーケンスの後ろ部分です。

source: If newMember is not contained in the set but subsumes current members of the set, the subsumed members are returned.
ja: newMemberがこの集合の中に含まれないしかしこの集合の現在の要素を包含するならば、包含されたメンバが返されます。

source: If nil, no line limit applies.
ja: nilならば、行限度は適用されません。

source: If nil, the accent color is the system default.
ja: nilならば、アクセントカラーはシステム初期設定のものです。

source: If nil, the amount is the system default amount.
ja: nilならば、その量はシステム省略時の量です。

source: If nil, the system default spacing between views is used.
ja: nilならば、ビュー間のシステム省略時の空きが使われます。

source: If nil, use the main bundle.
ja: nilならば、メインバンドルを使います。

source: If nil, use the table in the Localizable.strings file.
ja: nilならば、Localizable.stringsファイルの中のテーブルを使います。

source: If nil, uses the main Bundle.
ja: nilならば、メインBundleを使います。

source: If true, the alpha channel of the image must be one.
ja: trueならば、画像のアルファチャンネルは１つでなければなりません。

source: If true, the view is being added to the window using an animation.
ja: trueならば、ビューはウインドウにアニメーションを使って加えられています。

source: If width is nil, the resulting view assumes this view’s sizing behavior.
ja: widthがnilならば、結果ビューはこのビューのもつ大きさ決定挙動を仮定されます。

source: If nil, the accent color continues to be inherited
ja: nilならば、アクセントカラーは継承され続けます。

source: If distance is negative, this is the same value as the result of abs(distance) calls to index(before:).
ja: distanceが負ならば、これはabs(distance)がindex(before:)を呼び出すの結果と同じ値です。
